In [9]:
import pandas as pd

In [10]:
customerData = pd.read_csv('./datasets/customerData.csv', header=1)

In [11]:
customerData.head()

   Unnamed: 0         uid              reg_date device gender country  age
0         NaN  54030035.0  2017-06-29T00:00:00Z    and      M     USA   19
1         NaN  72574201.0  2018-03-05T00:00:00Z    iOS      F     TUR   22
2         NaN  64187558.0  2016-02-07T00:00:00Z    iOS      M     USA   16
3         NaN  92513925.0  2017-05-25T00:00:00Z    and      M     BRA   41
4         NaN  99231338.0  2017-03-26T00:00:00Z    iOS      M     FRA   59

In [17]:
customerData.drop('Unnamed: 0', axis=1, inplace=True)

In [18]:
customerData.head()

          uid              reg_date device gender country  age
0  54030035.0  2017-06-29T00:00:00Z    and      M     USA   19
1  72574201.0  2018-03-05T00:00:00Z    iOS      F     TUR   22
2  64187558.0  2016-02-07T00:00:00Z    iOS      M     USA   16
3  92513925.0  2017-05-25T00:00:00Z    and      M     BRA   41
4  99231338.0  2017-03-26T00:00:00Z    iOS      M     FRA   59

In [19]:
customerData.dtypes

uid         float64
reg_date     object
device       object
gender       object
country      object
age           int64
dtype: object

In [14]:
inAppPurchases = pd.read_csv('./datasets/inappPurchases.csv')

In [15]:
inAppPurchases.head()

,Unnamed: 0,date,uid,sku,price,Unnamed: 5,Unnamed: 6
0,NaN,2017-07-10,41195147,sku_three_499,499,NaN,NaN
1,NaN,2017-07-15,41195147,sku_three_499,499,NaN,NaN
2,NaN,2017-11-12,41195147,sku_four_599,599,NaN,NaN
3,NaN,2017-09-26,91591874,sku_two_299,299,NaN,NaN
4,NaN,2017-12-01,91591874,sku_four_599,599,NaN,NaN

In [20]:
inAppPurchases.drop(['Unnamed: 0', 'Unnamed: 5', 'Unnamed: 6'], axis = 'columns', inplace=True)

In [21]:
inAppPurchases.head()

         date       uid            sku  price
0  2017-07-10  41195147  sku_three_499    499
1  2017-07-15  41195147  sku_three_499    499
2  2017-11-12  41195147   sku_four_599    599
3  2017-09-26  91591874    sku_two_299    299
4  2017-12-01  91591874   sku_four_599    599

In [22]:
inAppPurchases.dtypes

date     object
uid       int64
sku      object
price     int64
dtype: object

In [24]:
uidPurchasesjoined = inAppPurchases.merge(customerData, on = ['uid'], how='inner')

In [25]:
uidPurchasesjoined.head()

,date,uid,sku,price,reg_date,device,gender,country,age
0,2017-07-10,41195147,sku_three_499,499,2017-06-26T00:00:00Z,and,M,BRA,17
1,2017-07-15,41195147,sku_three_499,499,2017-06-26T00:00:00Z,and,M,BRA,17
2,2017-11-12,41195147,sku_four_599,599,2017-06-26T00:00:00Z,and,M,BRA,17
3,2017-09-26,91591874,sku_two_299,299,2017-01-05T00:00:00Z,and,M,TUR,17
4,2017-12-01,91591874,sku_four_599,599,2017-01-05T00:00:00Z,and,M,TUR,17

In [26]:
uidPurchasesjoined.shape

(9006, 9)

In [27]:
customerData.head()

          uid              reg_date device gender country  age
0  54030035.0  2017-06-29T00:00:00Z    and      M     USA   19
1  72574201.0  2018-03-05T00:00:00Z    iOS      F     TUR   22
2  64187558.0  2016-02-07T00:00:00Z    iOS      M     USA   16
3  92513925.0  2017-05-25T00:00:00Z    and      M     BRA   41
4  99231338.0  2017-03-26T00:00:00Z    iOS      M     FRA   59

In [30]:
customerData['reg_date_formated'] = customerData['reg_date'].apply(lambda x: x[:10])

In [31]:
customerData.head()

,uid,reg_date,device,gender,country,age,reg_date_formated
0,54030035.0,2017-06-29T00:00:00Z,and,M,USA,19,2017-06-29
1,72574201.0,2018-03-05T00:00:00Z,iOS,F,TUR,22,2018-03-05
2,64187558.0,2016-02-07T00:00:00Z,iOS,M,USA,16,2016-02-07
3,92513925.0,2017-05-25T00:00:00Z,and,M,BRA,41,2017-05-25
4,99231338.0,2017-03-26T00:00:00Z,iOS,M,FRA,59,2017-03-26

In [ ]:
uid_date_combined_data = app_purchases.merge(customer_data, on=['uid', 'date'], how='inner')